---
kind: type
id: T:Autodesk.Revit.DB.FootPrintRoof
source: html/97eb52e6-5dfd-86b3-708d-aabcda389f4a.htm
---
# Autodesk.Revit.DB.FootPrintRoof

Represents kinds of FootPrintRoofs.

## Syntax (C#)
```csharp
public class FootPrintRoof : RoofBase
```

## Remarks
The FootPrintRoof object represents some kinds of FootPrintRoof in Revit. The RoofType
property is used to distinguish the type of the roof.